Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་པ་ ནི །_ དམིགས་པ འི་ སྤོབས་པ་ དཔག་ ཏུ་ མེད་པ འོ །_།
en: Śāradvatī­putra, to refer to the mind of awakening engendered by bodhisattvas takes immeasurable eloquence.

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ དེ་བཞིན་ གཤེགས་ པ་ ནི་ དམིགས་པ འི་ སྤོབས་པ་ གཅིག་པ་ མ་ ཡིན་ གྱི །_ དམིགས་པ འི་ སྤོབས་པ་ དཔག་ ཏུ་ མེད་པ འོ །_།
en: Śāradvatī­putra, to refer to the Thus-Gone One takes not just one kind of eloquence, but immeasurabe eloquence.

source: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རྣམས་ ཀྱི་ སེམས་བསྐྱེད་པ་ ནི །_ ངས་ སྤོབས་པ་ དཔག་ ཏུ་ མེད་པ་ ཉིད་ ཀྱིས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོངས་སུ་ གནས་པ འི་ དམིགས་པ ས་ ཡོངས་སུ་ བཞག་པ འི་ ཕྱིར་ རོ །_།
en: It is because I explain the mind of awakening engendered by bodhisattvas with immeasurable eloquence by referring to the steadfastness of the trichiliocosm.

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ བྱང་ཆུབ་ ཀྱི་ སེམས་བསྐྱེད་པ་ ཡོངས་སུ་ གནས་པ་ དེ་དེ་ དང་ འདྲ་བ འི་ ཕྱིར་ ཏེ །_
en: It is because, Śāradvatī­putra, the steadfastness of the mind set on awakening is similar to that steadfastness.

source: འདི་ལྟར་ དེ་ལས་ བརྩམས་ ནས །_ |#| དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཀྱིས་ བསྐལ་པ འམ །_ བསྐལ་པ་ ལས་ ལྷག་པ འམ །_ དེ་བ ས་ ཀྱང་ ལྷག་པ ར་ བསྟན་ ཀྱང་ །_ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་པ་ དེ་ ནི་ ཟད་པ འམ །_ ཡོངས་སུ་ ཉམས་པ ར་ མི་ འགྱུར་ རོ །_།
en: In this way, even were the Thus-Gone One, the Worthy One, the perfect Buddha to teach, starting from there, for an eon, more than an eon, or even longer than that, the topic of the mind of awakening engendered by bodhisattvas would still not be exhausted or depleted. [163.b]

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་པ་ དེ་ ནི་ ཐུལ་བ ར་ དཀའ་བ འི་ བྱ་བ་ དང་ །_ བསྙེན་པ ར་ དཀའ་བ འི་ བྱ་བ་ དང་ །_ མངོན་དུ་ འཕགས་པ འི་ བྱ་བ་ དང་ །_ སེམས་ཅན་ བདེ་བ ར་ བྱེད་པ འི་ བྱ་བ་ དང་ །_ ཉམས་ དགའ་བ ར་ བྱེད་པ འི་ བྱ་བ་ དང་ །_ དགའ་བ འི་ བྱ་བ་ དང་ །_ ཁམས་ གསུམ་ འགྱུར་བ འི་ བྱ་བ་ དང་ །_ ཡེ་ཤེས་ ཆེན་པོ་ འགྱུར་བ འི་ བྱ་བ་ དང་ །_ གཏིང་དཔག་ དཀའ་བ འི་ བྱ་བ་ དང་ །_ མ་ཆགས་པ འི་ བྱ་བ་ དང་ །_ སྣང་བ་ ཆེན་པོ འི་ བྱ་བ་ དེ་ འདྲ་བ འི་ བྱ་བ ས་ ཡོངས་སུ་ གནས་པ འི་ ཕྱིར་ ཏེ །_
en: This is because, Śāradvatī­putra, the mind of awakening engendered by bodhisattvas is made steadfast by such activities that are hard to subdue; |#| activities that are unparalleled; |#| activities that are exalted, that bring happiness to beings, and that please beings; |#| joyous activities; |#| activities that involve the three realms; |#| activities that involve great wisdom; |#| activities that are difficult to fathom; |#| activities of dispassion; |#| and activities of great illumination.

source: ཤ་ར་ དྭ་ཏི འི་ བུ །_ མདོར་ན་ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་པ་ ནི་ བྱ་བ་ དེ་ འདྲ་བ ས་ བགྲང་བ འི་ མཐའ་ བྱ་བ ར་ མི་ ནུས་ སོ །_།
en: Śāradvatī­putra, in short, due to such activities it is impossible to conclusively account for the mind of awakening engendered by bodhisattvas.

source: སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོངས་སུ་ གནས་པ་ ན །_
en: when the trichiliocosm is steadfast,

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ནི་ སྟོང་ གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ན་ སེམས་ཅན་ ཇི་སྙེད་ ཡོད་པ་ དེ་དག་ གིས་ ཉེ་བ ར་ སྤྱད་པ ར་ བྱ་བ འི་ ཕྱིར་ རབ་ཏུ་ གནས་པ་ ཡིན་ ནོ །_།
en: that world system is steadfast for all the myriad beings that exist throughout the trichiliocosm to partake of.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་པ་ རབ་ཏུ་ གནས་པ་ ན །_
en: Likewise, Śāradvatī­putra, one should understand that when the mind of awakening engendered by bodhisattvas is steadfast,

source: དེ་ ནི་ སེམས་ཅན་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་ པ འི་ ཡེ་ཤེས་ ཉེ་བ ར་ སྤྱོད་པ འི་ གནས་ སུ་ གྱུར་པ་ ཡིན་པ ར་ གནས་པ་ དེ་ལྟ་ བུར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: it is stable in that it serves as a basis for immeasurable, innumerable beings to partake of wisdom.

source: རི འི་ རྒྱལ་པོ་ རི་རབ་ རབ་ཏུ་ གནས་པ་ ན །_ |#| ཤ་ར་དྭ་ཏི འི་ བུ་ ལྷ འི་ བུ་ སྟོང་ཕྲག་ མང་པོ འི་ གནས་ ཡིན་པ ར་ འགྱུར་བ་ དང་ །_ དེ་ ལ་ གནས་ ནས་ |#| _སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ གྱི་ དམག་ མང་པོ་ ཕམ་པ ར་ བྱེད་པ ར་ འགྱུར་བ་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: one should understand that when Mount Sumeru, the king of mountains, is steadfast, it serves as the abode for many thousands of gods, and, dwelling there, the gods of the Heaven of the Thirty-Three defeat the many armies of the demigods.

source: དེ་ ནི་ ཉན་ཐོས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ འི་ གནས་ ཡིན་པ ར་ འགྱུར་ རོ །_།
en: it becomes the abode of immeasurable, innumerable hearers.

source: དེ་ ལ་ གནས་ ནས་ |#| ལྷ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ གྱི་ དམག་ དག་ ཕམ་པ ར་ བྱེད་པ ར་ འགྱུར་བ་ ཇི་ལྟ་བ་ དེ་བཞིན་ དུ །_ ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ལ་ གནས་ ནས་ |#| སེམས་ཅན་ དཔག་ ཏུ་ མེད་པ་ གཞན་དག་ གིས་ ཀྱང་ བློ་གྲོས་ སྦྱང་ དཀའ་བ འི་ བདུད་ ཀྱི་ དཔུང་ དག་ ཀྱང་ ཕམ་པ ར་ བྱེད་པ ར་ [164a] འགྱུར་བ་ ཡིན་ ནོ །_།
en: Just as the gods, while dwelling there on Mount Sumeru, defeat the armies of demigods, so too, Śāradvatī­putra, do other immeasurably many beings, while dwelling there within the mind of awakening, defeat the forces of Māra whose will is difficult to break. [164.a]

source: རི འི་ རྒྱལ་པོ་ ཁོར་ཡུག་ ཆེན་པོ་ དག་ རབ་ཏུ་ གནས་པ་ ན །_ |#| སེམས་ཅན་ གང་དག་ ཁོངས་ སུ་ གཏོགས་པ་ དེ་དག་ ཐམས་ཅད་ ནི་ ཐོགས་པ་ མེད་པར་ འགྲོ་བ འི་ རླུང་ གི་ དཀྱིལ་འཁོར་ དག་ གིས་ ཐུལ་བ ར་ དཀའ་བ ར་ འགྱུར་བ་ ཡིན་པ ར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: one should understand that when the Mahācakravāḍa Range, the kings of mountains, is steadfast, any being included therein is invulnerable to the swirling gusts of wind that course without impediment.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ དུ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་ པར་ རབ་ཏུ་ གནས་པ་ ན །_
en: Śāradvatī­putra, likewise, one should understand that this is similar to how, when the mind set upon unexcelled and perfect awakening engendered by bodhisattvas is steadfast,

source: གནས་ ཀྱི་ འདུ་ཤེས་ ཅན་ སེམས་ཅན་ གང་དག་ བྱང་ཆུབ་ སེམས་དཔ འི་ ཁོངས་ སུ་ གཏོགས་པ་ དེ་ལྟ་ བུར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: any being with a conception of this is included among bodhisattvas.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་དག་ ནི་ ཉོན་མོངས་པ འི་ རླུང་ གི་ དཀྱིལ་འཁོར་ ཐམས་ཅད་ ཀྱིས་ ཐུལ་བ ར་ དཀའ་བ་ ཡིན་ ནོ །_།
en: Śāradvatī­putra, they are invulnerable to all the swirling gusts of wind of the afflictions.

source: རི འི་ རྒྱལ་པོ་ གངས་རི་ རབ་ཏུ་ གནས་པ་ ན །_ |#| དེ་ ནི་ སྨན་ ཐམས་ཅད་ ཀྱི་ གནས་ སུ་ གྱུར་པ ར་ རབ་ཏུ་ གནས་པ་ དེ་ལྟ་ བུར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: one should understand that when Mount Himavān, the king of mountains, is steadfast, it provides the basis for all medicines.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་ པར་ རབ་ཏུ་ གནས་པ་ ན །_ |#| ཤ་ར་དྭ་ཏི འི་ བུ་ སེམས་ཅན་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ འི་ ཉོན་མོངས་པ འི་ ནད་ ཡང་དག་ པར་ གཞོམ་པ ར་ བྱ་བ འི་ ཕྱིར །_ ཡེ་ཤེས་ ཆེན་པོ འི་ སྨན་ དེ་ རབ་ཏུ་ གནས་པ་ དེ་ལྟ་ བུར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: Likewise, Śāradvatī­putra, one should understand that when the mind of awakening engendered by bodhisattvas is steadfast, the medicine of great wisdom is steadfast to perfectly eradicate the illness of afflictions for immeasurable, countless beings.

source: རིན་པོ་ཆེ འི་ འབྱུང་གནས་ ཆེན་པོ་ རབ་ཏུ་ གནས་པ་ ན །_ |#| དེ་ ནི་ སེམས་ཅན་ འབུམ་ཕྲག་ མང་པོ་ ལ་ ཕན་ འདོགས་པ ར་ གྱུར་པ་ ཡིན་ པ ར་ འགྱུར་བ་ དང་ །_ ཀུན་ བགེད་པ་ ཡིན་པ ར་ འགྱུར་བ་ དང་ །_ འདུ་བ་ ཡིན་པ ར་ འགྱུར་བ་ དེ་ལྟ་ བུར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: one should understand that when the great source of gems#65 is steadfast, it benefits, contributes to,#66 and subsumes many hundreds of thousands of beings.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ དུ །_ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་པ་ རབ་ཏུ་ གནས་པ་ ན །_ |#| དེ་ ནི་ སེམས་ཅན་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ ལ་ ཕན་ འདོགས་པ་ ཡིན་པ ར་ འགྱུར་བ་ དང་ །_ དེ་ ནི་ འདི་ལྟ་སྟེ །_ |#| ཆོས་ དཀོན་མཆོག་ གི་ རྗེས་སུ་ སྤྱོད་པ་ ཉིད་ ཀྱིས་ ཀུན་ བགེད་པ་ ཡིན་པ ར་ འགྱུར་བ་ དེ་ལྟ་ བུར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: Śāradvatī­putra, likewise, one should understand that when the mind of awakening engendered by bodhisattvas is steadfast, it benefits immeasurable, countless beings, and, in the same vein, it contributes to them through their enjoyment of the gems of Dharma.

source: ཉི་མ འི་ གཞལ་མེད་ ཁང་ དང་ །_ དེ་ ལ་ ལྷ འི་ བུ་ ཉི་མ་ གནས་ [164b] པར་ བྱེད་པ་ རབ་ཏུ་ གནས་པ་ ན །_ |#| ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ནི་ གླིང་བཞི་པ་ ཐམས་ཅད་ དུ་ སྣང་བ་ ཡིན་པ ར་ འགྱུར་བ་ དང་ །_ འོད་ དུ་ འགྱུར་བ་ ཡིན་པ་ དང་ །_ ཚ་བ་ ཡིན་པ ར་ འགྱུར་བ་ དེ་ལྟ་ བུར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: one should understand that when the chariot of the sun and the sun that rides it are steadfast, [164.b] they shine, bringing light and heat throughout the entire four continents.

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་ བསྐྱེད་པ་ དང་ །_ བྱང་ཆུབ་ སེམས་དཔ འི་ ཡེ་ཤེས་ ཆེན་པོ འི་ གནས་ ཐེག་པ་ ཆེན་པོ་ ལ་ མངོན་པར་ ཞོན་ ཞིང་ །_ གནས་པ ར་ བྱེད་པ་ རབ་ཏུ་ གནས་པ་ ན །_ |#| དེ་ ནི་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ན་ སྣང་བ་ བྱེད་པ་ ཡིན་པ ར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: Likewise, Śāradvatī­putra, one should understand that when the bodhisattvas’ engendering of the mind of awakening and their abode of great wisdom, which ride and abide in the Great Vehicle, are steadfast, they shine throughout the trichiliocosm.

source: ཤ་ར་ དྭ་ཏི འི་ བུ་ འདི་ལྟ་སྟེ །_ |#| དཔེར་ན་
en: $1307 “Śāradvatī­putra, it is like this: |#| As an analogy,

source: ཀླུ འི་ རྒྱལ་པོ་ མ་ དྲོས་པ འི་ གནས་ རབ་ཏུ་ གནས་པ་ ན །_ |#| ཤ་ར་དྭ་ཏི འི་ བུ་ ཀླུ འི་ རྒྱལ་པོ་ ཆེན་པོ་ དེ་དེ ར་ གནས་པ ར་ བྱེད་པ ར་ འགྱུར་བ་ དང་ །_ ཕྱོགས་ བཞི ར་ ཆུ་ ཀླུང་ ཆེན་པོ་ བཞི་ ཡང་ གཏོང་བ ར་ འགྱུར་བ་ དང་ །_ དེ་དག་ གིས་ རྐང་གཉིས་པ་ དང་ །_ རྐང་ བཞི་པ་ དག་ གི་ སྐོམ་པ ས་ འཇིགས་པ འི་ དོན་ བྱེད་པ ར་ འགྱུར་བ་ དང་ །_ འབྲུ་དང་ །_ སྨན་ དང་ །_ ཤིང་ ལྗོན་པ་ དང་ །_ ནགས་ཚལ་ དག་ མངོན་པར་ སྐྱེད་པ ར་ འགྱུར་བ་ དང་ །_ རིན་པོ་ཆེ འི་ འབྱུང་གནས་ རྒྱ་མཚོ་ ཆེན་པོ་ ཡང་ ཀུན་ དུ་ ཚིམ་པ ར་ བྱེད་པ ར་ འགྱུར་བ་ དེ་ལྟ་ བུར་ རིག་པ ར་ བྱ་ བ་ ཡིན་ ནོ །_།
en: one should understand that when the abode of the nāga king Anavatapta is steadfast, Śāradvatī­putra, it enables that nāga king to dwell there and distribute the four great rivers throughout the four directions, and those rivers benefit all those with two legs or four legs who are imperiled by thirst; |#| enable the growth of grains, medicines, trees, and forests; |#| and replenish the ocean, the source of gems.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ དུ །_ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་པ་ དེ་ རབ་ཏུ་ གནས་པ་ ན །_ |#| བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དེ་ ལ་ གནས་པ་ ན་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ སངས་རྒྱས་ ཏེ །_
en: Likewise, Śāradvatī­putra, [one should understand that ]when the mind of awakening engendered by bodhisattvas is steadfast, and bodhisattvas dwell within it, they fully awaken to unexcelled and perfect buddhahood. [At that point they distribute the four rivers of the Dharma—the river of genuine discrimination with respect to phenomena, the river of genuine discrimination with respect to meaning, the river of genuine discrimination with respect to language, and the river of genuine discrimination with respect to eloquence. With the waters of the precious Dharma, resounding with the sounds of emptiness, signlessness, wishlessness, and the eightfold path of the noble ones, and with the waters of the five masteries, five powers, and seven branches of awakening, [165.a] they quench the thirst of the afflictions of many, immeasurable, countless beings. Then, just as the great rivers flow into the ocean, these waters come to replenish the great ocean of dispassion.]

source: ཆོས་ ཀྱི་ ཆུ་ ཀླུང་ རྣམ་པ་ བཞི་ པོ་ འདི་ལྟ་སྟེ །_ |#| དོན་ སོ་སོ་ ཡང་དག་ པར་ རིག་པ འི་ ཆུ་ ཀླུང་ དང་ །_ ཆོས་ སོ་སོ་ ཡང་དག་ པར་ རིག་པ འི་ ཆུ་ ཀླུང་ དང་ །_ ངེས་པ འི་ ཚིག་ སོ་སོ་ ཡང་དག་ པར་ རིག་པ འི་ ཆུ་ ཀླུང་ དང་ །_ སྤོབས་པ་ སོ་སོ་ ཡང་དག་ པར་ རིག་པ འི་ ཆུ་ ཀླུང་ དག་ གཏོང་བ ར་ བྱེད་པ ར་ འགྱུར་བ་ དང་ །_ སྟོང་པ་ ཉིད་ དང་ །_ མཚན་མ་ མེད་པ་ དང་ །_ སྨོན་པ་ མེད་པ་ དང་ །_ འཕགས་པ འི་ ལམ་ ཡན་ལག་ བརྒྱད་པ འི་ སྒྲ་དབྱངས་ ཀྱི་ ང་རོ་ཅན་ གྱི་ ཆོས་ དཀོན་མཆོག་ གི་ ཆུ་ དེ་ དང་ །_ དབང་པོ་ ལྔ་ དང་ །_ སྟོབས་ ལྔ་ དང་ །_ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ བདུན་ གྱི་ ཆུས་ སེམས་ཅན་ གྲངས་མེད་ [165a] དཔག་ ཏུ་ མེད་པ་ དུ་མ འི་ ཉོན་མོངས་པ འི་ སྲེད་པ་ རྒྱུན་ བཅད་ ནས
en: Likewise, Śāradvatī­putra, [one should understand that when the mind of awakening engendered by bodhisattvas is steadfast, and bodhisattvas dwell within it, they fully awaken to unexcelled and perfect buddhahood.] At that point they distribute the four rivers of the Dharma—the river of genuine discrimination with respect to phenomena, the river of genuine discrimination with respect to meaning, the river of genuine discrimination with respect to language, and the river of genuine discrimination with respect to eloquence. With the waters of the precious Dharma, resounding with the sounds of emptiness, signlessness, wishlessness, and the eightfold path of the noble ones, and with the waters of the five masteries, five powers, and seven branches of awakening, [165.a] they quench the thirst of the afflictions of many, immeasurable, countless beings. Then, [just as the great rivers flow into the ocean, these waters come to replenish the great ocean of dispassion.]

source: རྒྱ་མཚོ་ ཆེན་པོ འི་ ཆུ་ ཀླུང་ ཆེན་པོ་ བཞིན་ དུ །_ འདོད་ཆགས་ དང་ བྲལ་བ འི་ མཐ འི་ རྒྱ་མཚོ་ ཆེན་པོ་ ཚིམ་པ ར་ བྱེད་པ ར་ འགྱུར་བ་ དེ་ལྟ་ བུར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: [Likewise, Śāradvatī­putra, ]one should understand that [when the mind of awakening engendered by bodhisattvas is steadfast, and bodhisattvas dwell within it, they fully awaken to unexcelled and perfect buddhahood. At that point they distribute the four rivers of the Dharma—the river of genuine discrimination with respect to phenomena, the river of genuine discrimination with respect to meaning, the river of genuine discrimination with respect to language, and the river of genuine discrimination with respect to eloquence. With the waters of the precious Dharma, resounding with the sounds of emptiness, signlessness, wishlessness, and the eightfold path of the noble ones, and with the waters of the five masteries, five powers, and seven branches of awakening, [165.a] they quench the thirst of the afflictions of many, immeasurable, countless beings. Then, ]just as the great rivers flow into the ocean, these waters come to replenish the great ocean of dispassion.

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་པ་ དེ་ ཇི་སྲིད་ དུ་ རབ་ཏུ་ གནས་པ་ ནི་ ཆེན་པོ འི་ བྱ་བ་ དང་ །_ བསྙེན་པ ར་ དཀའ་བ འི་ བྱ་བ་ དང་ །_ མི་མཉམ་པ་ དང་ མཉམ་པ འི་ བྱ་བ ས་ རབ་ཏུ་ གནས་ ཏེ
en: $1308 “Śāradvatī­putra, for as long as the mind of awakening engendered by bodhisattvas is steadfast, it abides by great activities, activities that are hard to take up, activities that match the matchless. |#| Thus,

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ནི་ དེ་བཞིན་ གཤེགས་པ ས་ ཀྱང་ ཚིག་ གིས་ བསྟན་པ ར་ མི་ སྤྱོད་ དོ །_།
en: Śāradvatī­putra, even the Thus-Gone One does not come close to describing them all in language.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ལྟ་བས་ན །_ |#| གང་ སེམས་ཅན་ དེ་ལྟ་ བུ འི་ ཆོས་ དང་ ལྡན་པ འི་ གཏམ་ གྱིས་ རངས་པ ར་ བྱེད་ ཅིད་ ཡང་དག་ པར་ འཛིན་ དུ་ འཇུག་ ལ་ ཡང་དག་ པར་ གཟེངས་ སྟོད་པ འི་ རིགས་ ཀྱི་ བུ་ འམ་ རིགས་ ཀྱི་ བུ་མོ་ དེ་ ནི་ ཤ་ར་དྭ་ཏི འི་ བུ་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ ཆེན་པོ་ དཔག་ ཏུ་ མེད་པ་ བསྐྱེད་པ་ ཡིན་ ནོ །_།
en: $1309 “Śāradvatī­putra, it is for this reason that any noble son or daughter who delights a being with a sermon involving such a Dharma, and encourages them by compelling them to retain it, produces an immeasurably great heap of merit.

source: ཤ་ ར་དྭ་ཏི འི་ བུ་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ དེ འི་ བསོད་ནམས་ ཀྱི་ མཐའ་ ནི་ ཡོངས་སུ་ མྱ་ངན་ ལས་མ་ འདས་ ཀྱི་ བར་ དུ་ དེ་བཞིན་ གཤེགས་པ ས་ ཀྱང་ བསྟན་པ ར་ མི་ སྤྱོད་ དེ །_ |#| ཐེག་པ་ གང་དང་གང་ དུ་ ཡོངས་སུ་ བསྔོས་པ་ དེ་ དང་ དེར་ ཡང་ འགྲུབ་པ ར་ འགྱུར་ རོ །_།
en: Śāradvatī­putra, until reaching complete nirvāṇa the Thus-Gone One could not come close to describing the extent of that heap of merit, which will be accomplished according to the vehicle for which it was dedicated.

source: དེ་བཞིན་ གཤེགས་པ་ ལ་ ཕུལ་བ འི་ སྦྱིན་པ་ དང་ །_ དེ་བཞིན་ གཤེགས་པ་ ལ་ བསྐྱེད་པ འི་ དགེ་བ འི་ རྩ་བ་ དག་ ནི་ ཡོངས་སུ་ མྱ་ངན་ ལས་མ་ འདས་ ཀྱི་ བར་ དུ །_ བར་མ་དོ ར་ ཡོངས་སུ་ ཟད་པ ར་ ཡང་དག་ པར་ རྗེས་སུ་ མ་ མཐོང་ ངོ་ །_།
en: the roots of virtue from a gift offered to a thus-gone one, or those engendered in relation to a thus-gone one, are not seen to come to an end in the interim until one has reached complete nirvāṇa.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ དུ །_ ཆོས་ དང་ ལྡན་པ འི་ གཏམ་ གྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ རངས་པ ར་ བྱས་ ཤིང་ །_ ཡང་དག་ པར་ འཛིན་ དུ་ བཅུག་པ ས །_ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ་ ཆེན་པོ་ མ་ ཡིན་ གྱི་ བར་ དུ་བ ར་ མ་ དོར་ ཡོངས་སུ་ ཟད་པ འམ །_ ཡོངས་སུ་ གཏུགས་པ ར་ ཡང་དག་ པར་ རྗེས་སུ་ མ་ མཐོང་ སྟེ
en: Likewise, Śāradvatī­putra, the roots of virtue from delighting bodhisattvas with a Dharma sermon and compelling them to retain it are not seen to come to an end or reach completion in the interim until one has reached great, complete nirvāṇa.

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ རྣམ་ གྲངས་ དེས་ན་ དེ་ལྟ་ བུར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: Śāradvatī­putra, it is according to that reckoning that one should understand this.

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ སྔོན་བྱུང་བ་ འདས་པ འི་ དུས་ ན །_ |#| གང་ བྱུང་བ་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན །_ |#| བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་པོ འི་ གཞོན་ནུ་ ཆོས་ ཡོངས་སུ་ ཚོལ་ འདོད་པ་ ཞེས་ བྱ་བ་ བྱུང་བ ར་ གྱུར་ [165b] ཏོ །_།
en: $1311 “Śāradvatī­putra, long ago in the past, there was a royal bodhisattva prince called Dharma­paryeṣaṇakāma. [165.b]

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཆོས་ ཡོངས་སུ་ ཚོལ་ འདོད་པ་ དེས །_ |#| ལེགས་པ ར་ སྨྲས་པ་ ཇི་སྙེད་ ཐོས་པ་ དེ་དག་ ཐམས་ཅད་ བྲིས་ ཤིང་ །_ བླངས་ ལ །_ བརྗོད་ དེ །_ |#| ཐམས་ཅད་ ཀུན་ དུ་ བཟུང་ ངོ་ །_།
en: Śāradvatī­putra, the bodhisattva great being Dharma­paryeṣaṇakāma wrote down and embraced everything that was well said, and he would recite these teachings to the point of memorizing them all.

source: དེས་ ཀྱང་ དེ འི་ ཚེ །_ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཡོངས་སུ་ ཚོལ་ འདོད་པ །_ ཆོས་ ཡོངས་སུ་ ཚོལ་བ་ ལ་ མངོན་པར་ བརྩོན་པ ས །_ གྲོང་ ནས་ གྲོང་ དང་ །_ གྲོང་ཁྱེར་ ནས་ གྲོང་ཁྱེར་ དང་ །_ གྲོང་རྡལ་ ནས་ གྲོང་རྡལ་ དང་ །_ ལྗོངས་ ནས་ ལྗོངས་ སུ །_ ཆོས་ ཡོངས་སུ་ ཚོལ་བ་ ལ་ མངོན་ པར་ བརྩོན་ ཞིང་ །_ ཡོངས་སུ་ བཙལ་ ཏོ །_།
en: At that time, moreover, in his efforts to pursue the Dharma, Dharma­paryeṣaṇakāma would make every effort, searching for the Dharma from village to village, town to town, city to city, and country to country.

source: དེ འི་ ཚེ །_ མི་ གཅིག་ཅིག་ རི འི་ བྱ་སྐྱིབས་ ན་ འདུག་པ ར་ གྱུར་ ཏེ །_ |#| དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཡོངས་སུ་ ཚོལ་ འདོད་པ་ ལ་ སྨྲས་པ །_
en: Once there was a man sitting on a mountain slope who said to the bodhisattva Dharma­paryeṣaṇakāma, ‘Prince, come here!

source: གཞོན་ནུ་ ཚུ ར་ ཤོག་ དང་ །_ ཁོ་བོ ས་ ཁྱོད་ ལ་ དེ་བཞིན་ གཤེགས་པ འི་ མཚན་ དང་ ལྡན་པ འི་ གཏམ་ བྱ འོ །_།
en: I will give you a sermon about the qualities of a thus-gone one.’

source: དེ་ནས་ ཆོས་ ཡོངས་སུ་ ཚོལ་ འདོད་པ ས །_ རི འི་ བྱ་སྐྱིབས་ ན་ འདུག་པ འི་ མི་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ |#| ཕྱིན་ ནས་ |#| སྨྲས་པ །_
en: $1312 “Dharma­paryeṣaṇakāma then approached the man sitting on the mountain slope and said,

source: དེ་བཞིན་ གཤེགས་པ འི་ མཚན་ དང་ ལྡན་པ འི་ གཏམ་ རབ་ཏུ་ སྟོན་ ཅིག _།
en: ‘Please give me that sermon about the qualities of a thus-gone one!’

source: གཞོན་ནུ་ ཚིགས་ སུ་ བཅད་པ་ དེ་ ནི་ རིན་ མེད་པར་ ཁོ་བོ་ ཡང་དག་ པར་ རབ་ཏུ་ མི་ སྟོན་ ཏོ །_།
en: “ ‘Prince,’ |#| ‘as that teaching is priceless, I will not teach it!’

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ ཚེ་ རྒྱལ་པོ འི་ གཞོན་ནུ་ དེས །_ |#| གོས་ རིན་ཐང་ བྱེ་བ་ ཕྲག་ ཉི་ཤུ་ རི་བ་ ལུས་ ལ་ གྱོན་པ ར་ གྱུར་ ཅིང་ །_ ནོར་བུ་ རིན་པོ་ཆེ་ རིན་ཐང་ བྱེ་བ་ ཕྲག་ བཞི་ བཅུ་ རི་བ་ ཡང་ ལུས་ ལ་བཏགས་ པར་ གྱུར་ ཏོ །_།
en: $1313 “Śāradvatī­putra, the prince then donned a precious garment worth two hundred million and fastened to himself a precious gem worth four hundred million.

source: དེ་ནས་ འདོད་པ ས་ ཟིལ་ གྱིས་ ནོན་པ འི་ མི་ བརྐམ་ཆགས་པ་ དེ་ འདི་ སྙམ་ དུ་ སེམས་ ཏེ །_
en: The greedy man, overcome by desire, then thought,

source: གལ་ཏེ་ བདག་ ལ་ རྒྱལ་པོ འི་ གཞོན་ནུ་ དེས་ གོས་ དེ་ དང་ །_ ནོར་བུ་ རིན་པོ་ཆེ་ དེ་ བྱིན་པ ར་ གྱུར་ ན །_ |#| དེ་ལྟ་ན་ བདག་ གིས་ དེ་ ལ་ཚིགས་ སུ་ བཅད་པ་ དེ །_ |#| ཡང་དག་ པར་ རབ་ཏུ་ བསྟན་པ ར་ བྱ འོ །_། |#| སྙམ་ མོ །_།
en: ‘Now, if only the prince were to give me that garment and that precious gem, then I would teach him the verse.’

source: དེ་ནས་ ཆོས་ ཡོངས་སུ་ ཚོལ་ འདོད་པ འི་ མིས་ མི་ དེ་ ལ་ སྨྲས་པ །_
en: $1314 “Dharma­paryeṣaṇakāma said to the man,

source: ཀྱེ་ མི་ ཁྱོད་ ལ་ ཅི་ དགོས །_ |#| དེ་ སྨྲོས་ ཤིག་ དང་ །_ ཁོ་བོ ས་ ཁྱོད་ ལ་ སྦྱིན་པ ར་ བྱ འོ །_།
en: ‘Listen, tell me what you desire and you shall have it!

source: ཁྱོད་ ཀྱིས་ ཀྱང་ ཁོ་བོ་ ལ་ སངས་རྒྱས་ དང་ ལྡན་པ འི་ ཚིགས་ སུ་ བཅད་པ་ དེ་ཡང་ དག་པ ར་ རབ་ཏུ་ སྟོན་ ཅིག _།_
en: Teach me the verse about the Buddha!’ [166.a]

source: [166a] དེ་ནས་ མི་ དེས་ སྨྲས་པ །_
en: “So the man replied,

source: གཞོན་ནུ་ གལ་ཏེ །_ |#| ཁྱོད་ ཀྱིས་ ཇི་ལྟ ར་ བགོས་པ འི་ གོས་ དང་ ནོར་བུ་ རིན་པོ་ཆེ་ དེ་ བྱིན་ ཞིང་ བྱིན་ ནས་ ཀྱང་ བྱ་སྐྱིབས་ འདི་ ནས་ བདག་ཉིད་ བོར་ ན །_ |#| དེ་ལྟ་ན་ ཁོ་བོ ས་ ཁྱོད་ ལ་ཚིགས་ སུ་ བཅད་པ་ དེ་ཡང་ དག་པ ར་ རབ་ཏུ་ བསྟན་པ ར་ བྱ འོ །_།
en: ‘Prince, if you first give me the garment and the precious gem that you are wearing and then toss yourself off this slope, then I will teach you the verse.’

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཆོས་ ཡོངས་སུ་ ཚོལ་ འདོད་པ ས །_ མི་ དེ་ ལ་ སྨྲས་པ །_
en: $1315 “Śāradvatī­putra, the bodhisattva great being Dharma­paryeṣaṇakāma then said to the man,

source: ཀྱེ་ མི་ ཁྱོད་ ལ་དོན་ དུ་ འགྱུར་ ན །_ |#| བདག་ གིས་ རི འི་ བྱ་སྐྱིབས་ འདི་ ནས་ བདག་ཉིད་ དོར་བ ར་ བྱ འོ །_།
en: ‘If it is of benefit to you, then I shall throw myself off this mountain slope.’

source: གཞོན་ནུ་ བདག་ ལ་དོན་ དུ་ གང་ཡང་ མི་ འགྱུར་ མོད་ ཀྱི །_
en: ‘Prince, that will of course not do me any good at all.

source: འོན་ཀྱང་ གང་ གི་ ཚེ །_ ཁྱོད་ ཀྱིས་ ཁོ་བོ་ ལ་ གོས་ དེ་ དང་ །_ ནོར་བུ་ རིན་པོ་ཆེ་ དེ་ བྱིན་པ ར་ གྱུར་ ལ །_ དེ འི་ ཚེ་ ཁྱོད་ ཀྱིས་ ཚིགས་ སུ་ བཅད་པ་ དེ་ ཐོས་ ནས་ |#| འགྱོད་པ ར་ གྱུར་ ཏེ |#| དབང་ གི་ ཡང་ འཕྲོག་པ ར་ འགྱུར་ རོ །_།
en: However, if you give me that garment and that precious gem and then hear the verse, you might later have regret and forcefully take them back.’

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཡོངས་སུ་ ཚོལ་ འདོད་པ ས །_ མི་ དེ་ ལ་ སྨྲས་པ །_
en: the bodhisattva Dharma­paryeṣaṇakāma implored the man,

source: ཀྱེ་ མི་ ཁྱོད་ ཚིགས་ སུ་ བཅད་པ་ དེ་ ཁོ་བོ་ ལ་ སྟོན་ ཅིག་ དང་ །_
en: $1316 “ ‘Sir, please teach me the verse!’

source: ཁོ་བོ ས་ ཁྱོད་ ལ་ བྱིན་ ནས་ |#| འགྱོད་པ ར་ མི་ བྱ འོ །_།
en: ‘I will not regret having given those things to you.’

source: མི་ དེས་ སྨྲས་པ །_
en: said the man,’

source: གཞོན་ནུ་ ཁྱོད་ དམ་བཅས་པ་ ལ་ མི་ གནས་པ་ དེ་ཉིད་ ཀྱི་ ཚེ །_ ཁྱོད་ འགྱོད་པ ར་ བྱེད་པ་ ཡིན་ ནོ །_།
en: “ ‘Prince,’ |#| it is precisely when you are not keeping your promise that you are going to regret it.’

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཆོས་ ཡོངས་སུ་ ཚོལ་ འདོད་པ ས །_ མི་ དེ་ ལ་ སྨྲས་པ །_
en: $1317 “So the bodhisattva great being Dharma­paryeṣaṇakāma said,

source: ཀྱེ་ མི་ དེ འི་ ཕྱིར །_ གལ་ཏེ་ ཁྱོད་ དེ་ལྟ ར་ སེམས་ ན་ དེ་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱས །_
en: ‘Alright, if you think so, then I will fulfill your demand.

source: སངས་རྒྱས་ དང་ ལྡན་པ འི་ ཚིགས་ སུ་ བཅད་པ་ དེ་ ཁོ་བོ་ ལ་ སྟོན་ ཅིག་ དང་ །_ ཁོ་བོ ས་ ཁྱོད་ ལ་ གོས་ རིན་པོ་ཆེ་ དེ་ དང་ །_ ནོར་བུ་ རིན་པོ་ཆེ་ དེ་ སྦྱིན་པ ར་ བྱ འོ །_།
en: Teach me the verse about the Buddha! |#| I will then give you the precious garment and the precious gem.

source: ཚིགས་ སུ་ བཅད་པ་ དེ་ ཐོས་ ནས་ ཀྱང་ །_ རི འི་ བྱ་སྐྱིབས་ འདི་ ནས་ བདག་ཉིད་ དོར་བ ར་ བྱ འོ །_།
en: Once I have heard the verse, I will then throw myself off this mountain slope.’

source: ཤ་ར་དྭ་ཏི འི་ བུ་ མི་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་ ལ་ སངས་རྒྱས་ ཀྱི་ མཚན་ དང་ ལྡན་པ འི་ ཚིགས་ སུ་ བཅད་པ་ དེ་ བསྟན་ ཏོ །_།
en: $1318 “Śāradvatī­putra, the man then taught to the bodhisattva the verse about the qualities of the Buddha.
